Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs-shipyard</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_membership.this["laurentsenta"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "laurentsenta"
    }

  # github_repository_file.this["github-mgmt/CODEOWNERS"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - *       @galargh
          + # The ipdx team is responsible for GitHub Management maintenance
          + * @ipfs-shipyard/ipdx
          + 
          + # The github-mgmt stewards team is responsible for triaging/reviewing configuration change requests
          + # The ipdx team is added here temporarily to witness use patterns in github-mgmt
          + /github/ipfs.yml @ipfs-shipyard/github-mgmt-stewards @ipfs-shipyard/ipdx
        EOT
        id                  = "github-mgmt/CODEOWNERS"
        # (9 unchanged attributes hidden)
    }

  # github_team.this["github-mgmt stewards"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Users that are effectively org admins"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "github-mgmt stewards"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.this["ipdx"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ipdx"
      + node_id                   = (known after apply)
      + parent_team_id            = 4657018
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["github-mgmt stewards:BigLep"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "BigLep"
    }

  # github_team_membership.this["github-mgmt stewards:aschmahmann"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "aschmahmann"
    }

  # github_team_membership.this["github-mgmt stewards:guseggert"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "guseggert"
    }

  # github_team_membership.this["github-mgmt stewards:lidel"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "lidel"
    }

  # github_team_membership.this["github-mgmt stewards:willscott"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "willscott"
    }

  # github_team_membership.this["ipdx:galargh"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "galargh"
    }

  # github_team_membership.this["ipdx:laurentsenta"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "laurentsenta"
    }

  # github_team_repository.this["github-mgmt stewards:github-mgmt"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "github-mgmt"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["ipdx:github-mgmt"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "github-mgmt"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["w3dt-stewards:github-mgmt"] will be destroyed
  # (because key ["w3dt-stewards:github-mgmt"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"72d69375dad6efda92485e928ea2b3d41508b6d24eaecd5c8bb5d942c1bd2f93\"" -> null
      - id         = "4657018:github-mgmt" -> null
      - permission = "maintain" -> null
      - repository = "github-mgmt" -> null
      - team_id    = "4657018" -> null
    }

Plan: 12 to add, 1 to change, 1 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->